src/svc-cli.org
#+Title: MCS Command execute results

* 集群时间设置: time/zone
- 显示当前时区
#+BEGIN_SRC shell
  Inspur_MCS:Cluster_100.2.34.2:superuser>showtimezone
  id  timezone
  211 Asia/Hong_Kong
#+END_SRC

- 查看系统可用时区
#+BEGIN_SRC shell
  Inspur_MCS:Cluster_100.2.34.2:superuser>lstimezones
  id  timezone
  0   Africa/Abidjan
  1   Africa/Accra
  2   Africa/Addis_Ababa
  3   Africa/Algiers
  4   Africa/Asmera
  ...
  246 Asia/Shanghai
  247 Asia/Singapore
  248 Asia/Taipei
  ...
#+END_SRC

- 显示系统时间
  + 此命名不支持自动补齐(root登录, 查看/compass/bin了解更多不补齐命令)
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>svqueryclock
  Mon Sep  4 16:46:37 HKT 2017
#+END_SRC

- 设置时区
#+BEGIN_SRC shell
settimezone
#+END_SRC

- 设置时间
#+BEGIN_SRC shell
setsystemtime -time MMDDHHmmYYYY
# comment: month day hour minutes year
# other: MMDDHHmmYYYY.ss(seconds)
#+END_SRC

* 查看和更新: lslicense & chlicense
- lslicense查看当前License(许可证)设置
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>lslicense
  used_local 0.01
  used_remote 0.00
  used_virtualization 0.00
  license_local 0
  license_remote 0
  license_virtualization 0
  license_physical_disks 0
  license_physical_local off
  license_physical_remote off
  used_compression_capacity 0.00
  license_compression_capacity 0
  license_compression_enclosures 0
  license_in_tier 0
  license_cloud_enclosures 0
  scu_ratio_flash 1.00
  scu_ratio_enterprise 1.18
  scu_ratio_nearline 4.00
#+END_SRC

- chlicense设置系统License(许可证)
#+BEGIN_SRC shell
# HOW TO?
#+END_SRC

* 显示集群属性: lssystem
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>lssystem -delim :
  id:0000000027C27034
  name:C90
  location:local
  partnership:
  total_mdisk_capacity:24.4TB
  space_in_mdisk_grps:24.4TB
  space_allocated_to_vdisks:0.00MB
  total_free_space:24.4TB
  total_vdiskcopy_capacity:0.00MB
  total_used_capacity:0.00MB
  total_overallocation:0
  total_vdisk_capacity:0.00MB
  total_allocated_extent_capacity:0.00MB
  statistics_status:on
  statistics_frequency:15
  cluster_locale:en_US
  time_zone:211 Asia/Hong_Kong
  code_level:3.1.6.10 (build 133.18.1709012304000)
  console_IP:10.151.12.90:443
  id_alias:0000000027C27034
  ac_link_tolerance:300
  ac_inter_cluster_delay_simulation:0
  ac_intra_cluster_delay_simulation:0
  ac_max_host_delay:5
  email_reply:1@1.com
  email_contact:1
  email_contact_primary:111111
  email_contact_alternate:
  email_contact_location:1
  email_contact2:
  email_contact2_primary:
  email_contact2_alternate:
  email_state:stopped
  inventory_mail_interval:7
  cluster_ntp_IP_address:
  cluster_isns_IP_address:
  iscsi_auth_method:none
  iscsi_chap_secret:
  auth_service_configured:no
  auth_service_enabled:no
  auth_service_url:
  auth_service_user_name:
  auth_service_pwd_set:no
  auth_service_cert_set:no
  auth_service_type:tip
  relationship_bandwidth_limit:25
  tier:tier0_flash
  tier_capacity:0.00MB
  tier_free_capacity:0.00MB
  tier:tier1_flash
  tier_capacity:0.00MB
  tier_free_capacity:0.00MB
  tier:tier_enterprise
  tier_capacity:0.00MB
  tier_free_capacity:0.00MB
  tier:tier_nearline
  tier_capacity:24.41TB
  tier_free_capacity:24.41TB
  in_tier_acceleration:off
  has_nas_key:no
  layer:storage
  rc_buffer_size:48
  compression_active:no
  compression_virtual_capacity:0.00MB
  compression_compressed_capacity:0.00MB
  compression_uncompressed_capacity:0.00MB
  cache_prefetch:on
  email_organization:1
  email_machine_address:1
  email_machine_city:1
  email_machine_state:XX
  email_machine_zip:11111
  email_machine_country:CN
  total_drive_raw_capacity:32.75TB
  compression_destage_mode:off
  local_fc_port_mask:1111111111111111111111111111111111111111111111111111111111111111
  partner_fc_port_mask:1111111111111111111111111111111111111111111111111111111111111111
  high_temp_mode:off
  topology:standard
  topology_status:
  rc_auth_method:none
  vdisk_protection_time:15
  vdisk_protection_enabled:no
  product_name:Inspur AS5500G2
  odx:off
  max_replication_delay:0
  partnership_exclusion_threshold:315
  gen1_compatibility_mode_enabled:no
  inspur_customer:
  inspur_component:SANVCNSW1
  inspur_country:
  tier0_flash_compressed_data_used:0.00MB
  tier1_flash_compressed_data_used:0.00MB
  tier_enterprise_compressed_data_used:0.00MB
  tier_nearline_compressed_data_used:0.00MB
#+END_SRC

* 密码维护: setpwdreset
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>setpwdreset -show
  Password status: [1]
#+END_SRC

