svc-cli.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2018-02-25 Sun 01:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>MCS Command execute results</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yanyg" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css" />
<link rel="stylesheet" type="text/css" href="css/readtheorg.css" />
</head>
<body>
<div id="content">
<h1 class="title">MCS Command execute results</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgae7cd56">1. 集群时间设置: time/zone</a></li>
<li><a href="#org1e936bc">2. 查看和更新: lslicense &amp; chlicense</a></li>
<li><a href="#org3b67b7e">3. 显示集群属性: lssystem</a></li>
<li><a href="#org7b3b996">4. 密码维护: setpwdreset</a></li>
<li><a href="#orgb54ecd6">5. 查看dumps</a></li>
<li><a href="#org0281260">6. 重新扫瞄发现MDisks</a></li>
<li><a href="#orgd1aa31f">7. 存储池</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgae7cd56" class="outline-2">
<h2 id="orgae7cd56"><span class="section-number-2">1</span> 集群时间设置: time/zone</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>显示当前时区</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">Inspur_MCS:Cluster_100.2.34.2:superuser&gt;showtimezone
id  timezone
211 Asia/Hong_Kong
</pre>
</div>

<ul class="org-ul">
<li>查看系统可用时区</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">Inspur_MCS:Cluster_100.2.34.2:superuser&gt;lstimezones
id  timezone
0   Africa/Abidjan
1   Africa/Accra
2   Africa/Addis_Ababa
3   Africa/Algiers
4   Africa/Asmera
...
246 Asia/Shanghai
247 Asia/Singapore
248 Asia/Taipei
...
</pre>
</div>

<ul class="org-ul">
<li>显示系统时间
<ul class="org-ul">
<li>此命名不支持自动补齐(root登录, 查看/compass/bin了解更多不补齐命令)</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">Inspur_MCS:C90:superuser&gt;svqueryclock
Mon Sep  4 16:46:37 HKT 2017
</pre>
</div>

<ul class="org-ul">
<li>设置时区</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">settimezone
</pre>
</div>

<ul class="org-ul">
<li>设置时间</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">setsystemtime -time MMDDHHmmYYYY
<span class="org-comment-delimiter"># </span><span class="org-comment">comment: month day hour minutes year</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">other: MMDDHHmmYYYY.ss(seconds)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e936bc" class="outline-2">
<h2 id="org1e936bc"><span class="section-number-2">2</span> 查看和更新: lslicense &amp; chlicense</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>lslicense查看当前License(许可证)设置</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">Inspur_MCS:C90:superuser&gt;lslicense
used_local 0.01
used_remote 0.00
used_virtualization 0.00
license_local 0
license_remote 0
license_virtualization 0
license_physical_disks 0
license_physical_local off
license_physical_remote off
used_compression_capacity 0.00
license_compression_capacity 0
license_compression_enclosures 0
license_in_tier 0
license_cloud_enclosures 0
scu_ratio_flash 1.00
scu_ratio_enterprise 1.18
scu_ratio_nearline 4.00
</pre>
</div>

<ul class="org-ul">
<li>chlicense设置系统License(许可证)</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">HOW TO?</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3b67b7e" class="outline-2">
<h2 id="org3b67b7e"><span class="section-number-2">3</span> 显示集群属性: lssystem</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-shell">Inspur_MCS:C90:superuser&gt;lssystem -delim :
id:0000000027C27034
name:C90
location:local
partnership:
total_mdisk_capacity:24.4TB
space_in_mdisk_grps:24.4TB
space_allocated_to_vdisks:0.00MB
total_free_space:24.4TB
total_vdiskcopy_capacity:0.00MB
total_used_capacity:0.00MB
total_overallocation:0
total_vdisk_capacity:0.00MB
total_allocated_extent_capacity:0.00MB
statistics_status:on
statistics_frequency:15
cluster_locale:en_US
time_zone:211 Asia/Hong_Kong
code_level:3.1.6.10 (build 133.18.1709012304000)
console_IP:10.151.12.90:443
id_alias:0000000027C27034
ac_link_tolerance:300
ac_inter_cluster_delay_simulation:0
ac_intra_cluster_delay_simulation:0
ac_max_host_delay:5
email_reply:1@1.com
email_contact:1
email_contact_primary:111111
email_contact_alternate:
email_contact_location:1
email_contact2:
email_contact2_primary:
email_contact2_alternate:
email_state:stopped
inventory_mail_interval:7
cluster_ntp_IP_address:
cluster_isns_IP_address:
iscsi_auth_method:none
iscsi_chap_secret:
auth_service_configured:no
auth_service_enabled:no
auth_service_url:
auth_service_user_name:
auth_service_pwd_set:no
auth_service_cert_set:no
auth_service_type:tip
relationship_bandwidth_limit:25
tier:tier0_flash
tier_capacity:0.00MB
tier_free_capacity:0.00MB
tier:tier1_flash
tier_capacity:0.00MB
tier_free_capacity:0.00MB
tier:tier_enterprise
tier_capacity:0.00MB
tier_free_capacity:0.00MB
tier:tier_nearline
tier_capacity:24.41TB
tier_free_capacity:24.41TB
in_tier_acceleration:off
has_nas_key:no
layer:storage
rc_buffer_size:48
compression_active:no
compression_virtual_capacity:0.00MB
compression_compressed_capacity:0.00MB
compression_uncompressed_capacity:0.00MB
cache_prefetch:on
email_organization:1
email_machine_address:1
email_machine_city:1
email_machine_state:XX
email_machine_zip:11111
email_machine_country:CN
total_drive_raw_capacity:32.75TB
compression_destage_mode:off
local_fc_port_mask:1111111111111111111111111111111111111111111111111111111111111111
partner_fc_port_mask:1111111111111111111111111111111111111111111111111111111111111111
high_temp_mode:off
topology:standard
topology_status:
rc_auth_method:none
vdisk_protection_time:15
vdisk_protection_enabled:no
product_name:Inspur AS5500G2
odx:off
max_replication_delay:0
partnership_exclusion_threshold:315
gen1_compatibility_mode_enabled:no
inspur_customer:
inspur_component:SANVCNSW1
inspur_country:
tier0_flash_compressed_data_used:0.00MB
tier1_flash_compressed_data_used:0.00MB
tier_enterprise_compressed_data_used:0.00MB
tier_nearline_compressed_data_used:0.00MB
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b3b996" class="outline-2">
<h2 id="org7b3b996"><span class="section-number-2">4</span> 密码维护: setpwdreset</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-shell">Inspur_MCS:C90:superuser&gt;setpwdreset -show
Password status: [1]
</pre>
</div>
</div>
</div>
