src/svc-cli.org
* 查看dumps
- lsdumps
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>lsdumps
  id filename
  0  reinst.000000.trc
  1  000000.trc
  2  inst.170807.trc
  3  mcs.config.cron.log_6577501-1
  4  mcs.config.cron.sh_6577501-1
  5  mcs.config.cron.xml_6577501-1
  6  dump.6577501-1.170808.083608
  7  dump.6577501-1.170808.104202
  8  inst.170808.trc
  9  inst.170809.trc
  10 mcs.config.cron.sh_6577501-2
  11 mcs.config.cron.log_6577501-2
  12 mcs.config.cron.bak_6577501-2
  13 mcs.config.cron.xml_6577501-2
  14 dump.6577501-1.170811.141924
  15 inst.170811.trc
  16 dump.6577501-1.170815.112234
  17 inst.170816.trc
  18 inst.170818.trc
  19 livedump.keymgr.6577501-1.170821.120041
  20 livedump.ietd.6577501-1.170821.120041
  21 livedump.keymgr.6577501-1.170821.120509
  22 livedump.ietd.6577501-1.170821.120509
  23 dump.6577501-1.170821.120525
  24 dump.6577501-1.170821.120059
  25 livedump.ietd.6577501-1.170821.121154
  26 livedump.keymgr.6577501-1.170821.121154
  27 dump.6577501-1.170821.121210
  28 dump.6577501-1.170821.142111
  29 livedump.keymgr.6577501-1.170821.143206
  30 livedump.ietd.6577501-1.170821.143206
  31 dump.6577501-1.170821.143222
  32 livedump.ietd.6577501-1.170821.145402
  33 livedump.keymgr.6577501-1.170821.145402
  34 livedump.ietd.6577501-1.170821.150054
  35 livedump.keymgr.6577501-1.170821.150054
  36 dump.6577501-1.170821.150158
  37 dump.6577501-1.170821.152314
  38 livedump.ietd.6577501-1.170821.152819
  39 livedump.keymgr.6577501-1.170821.152819
  40 dump.6577501-1.170821.152835
  41 dump.6577501-1.170821.145421
  42 inst.170821.trc
  43 inst.170822.trc
  44 keymgr.6577501-1.trc.old
  45 dump.6577501-1.170824.095831
  46 cloudd.6577501-1.trc.old
  47 dump.6577501-1.170828.103554
  48 livedump.keymgr.6577501-1.170828.135633
  49 livedump.ietd.6577501-1.170828.135633
  50 dump.6577501-1.170828.135656
  51 livedump.ietd.6577501-1.170828.142239
  52 livedump.keymgr.6577501-1.170828.142239
  53 dump.6577501-1.170828.142301
  54 dump.6577501-1.170828.163131
  55 dump.6577501-1.170828.164804
  56 dump.6577501-1.170828.172548
  57 inst.170828.trc
  58 livedump.keymgr.6577501-1.170829.111431
  59 livedump.ietd.6577501-1.170829.111431
  60 ethernet.6577501-1.stats
  61 dump.6577501-1.170829.111449
  62 inst.170829.trc
  63 cl_debug.trc
  64 inst.170830.trc
  65 inst.170831.trc
  66 bios_update.2.log
  67 pex86.2.log
  68 svc_config_push.6577501-1.trc
  69 bios_update.1.log
  70 pex86.1.log
  71 endd.trc.old
  72 inst.170901.trc
  73 fsck_test
  74 pex86.0.log
  75 bios_update.0.log
  76 boot.6577501-1.trc
  77 ec_makevpd.6577501-1.trc
  78 Techport_DHCP_DNS.old.trc
  79 keymgr.kmip.6577501-1.trc
  80 Techport_DHCP_DNS.log
  81 6577501-1.trc.old
  82 rtc.racemqB_log.txt.6577501-1.trc
  83 rtc.racemqA_log.txt.6577501-1.trc
  84 racemqA_log.txt
  85 racemqB_log.txt
  86 ethernet.6577501-1.trc
  87 keymgr.6577501-1.trc
  88 cloudd.6577501-1.trc
  89 endd.trc
  90 6577501-1.trc
#+END_SRC
  + 用prefix指定特定目录
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>lsdumps -prefix /dumps/audit
  id  filename
  0   auditlog_0_499_20170823155544_0000000026627034
  1   auditlog_500_999_20170823160723_0000000026627034
  2   auditlog_1000_1499_20170823160836_0000000026627034
  3   auditlog_1500_1999_20170823161113_0000000026627034
  4   auditlog_2000_2499_20170823161844_0000000026627034
  5   auditlog_2500_2999_20170823170115_0000000026627034
  6   auditlog_3000_3499_20170823214348_0000000026627034
  7   auditlog_3500_3999_20170823224521_0000000026627034
  8   auditlog_4000_4499_20170824001312_0000000026627034
  9   auditlog_4500_4999_20170824015534_0000000026627034
  10  auditlog_5000_5499_20170824035200_0000000026627034
  11  auditlog_5500_5999_20170824054846_0000000026627034
  12  auditlog_6000_6499_20170824073055_0000000026627034
  13  auditlog_6500_6999_20170824084533_0000000026627034
  14  auditlog_7000_7499_20170824095148_0000000026627034
  15  auditlog_7500_7999_20170824102125_0000000026627034
  16  auditlog_8000_8499_20170824102806_0000000026627034
  17  auditlog_8500_8999_20170824103435_0000000026627034
  18  auditlog_9000_9499_20170824104210_0000000026627034
  19  auditlog_9500_9999_20170824104900_0000000026627034
  20  auditlog_10000_10499_20170824105542_0000000026627034
  21  auditlog_10500_10999_20170824110230_0000000026627034
  22  auditlog_11000_11499_20170824110933_0000000026627034
  23  auditlog_11500_11999_20170824111622_0000000026627034
  24  auditlog_12500_12999_20170824113005_0000000026627034
  25  auditlog_13000_13499_20170824113700_0000000026627034
  26  auditlog_13500_13999_20170824114340_0000000026627034
  27  auditlog_14000_14499_20170824115027_0000000026627034
  28  auditlog_14500_14999_20170824115732_0000000026627034
  29  auditlog_15000_15499_20170824120332_0000000026627034
  30  auditlog_15500_15999_20170824121103_0000000026627034
#+END_SRC
可选的目录前缀包括:
#+BEGIN_QUOTE
   (Optional) Specifies the name of the directory to list files for. The
   default is the /dumps directory. Valid directory names:
   *  /dumps
   *  /dumps/audit
   *  /dumps/cimom
   *  /dumps/cloud
   *  /dumps/elogs
   *  /dumps/feature
   *  /dumps/iostats
   *  /dumps/iotrace
   *  /dumps/mdisk
   *  /home/admin/update
   *  /dumps/drive
   *  /dumps/enclosure
#+END_QUOTE

- cpdumps从非配置节点拷贝到配置节点
- cleardumps删除指定节点的dump
- catauditlog显示内存中的audit log
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>catauditlog
  audit_seq_no timestamp    cluster_user challenge source_panel target_panel ssh_ip_address result res_obj_id action_cmd
  0            170904085119 superuser                                        10.72.221.160  0                 mcsop chsystem -name C90
  1            170904085119 superuser                                        10.72.221.160  0                 mcsop chsystem -ntpip 0.0.0.0
  2            170904085119 superuser                                        10.72.221.160  0                 mcsop settimezone -timezone 211
  3            170904085119 superuser                                        10.72.221.160  0                 mcsop chsystem -invemailinterval 7
  4            170904085120 superuser                                        10.72.221.160  0                 mcsop chemail -address 1 -city 1 -contact 1 -country CN -location 1 -
  organization 1 -primary 111111 -reply 1@1.com -state XX -zip 11111
  5            170904085120 superuser                                        10.72.221.160  0                 mcsop chsystem -easysetup no
  6            170904085120 superuser                                        10.72.221.160  0      0          mcsop mkdnsserver -ip 10.150.1.11 -name DNS0
  7            170904085139 superuser                                        10.72.221.160  0      0          mcsop mkcloudaccountaliyunoss -name zreal -bucket new-storage-cs-shan
  ghai -accesskeyid LTAILyUd5jmlvMzf -secretaccesskey #### -region oss-cn-shanghai -encrypt no
  8            170904085258 superuser                                        10.72.221.160  0                 mcsop rmcloudaccount 0
  9            170904093334 superuser                                        10.165.21.185  0      0          mcsop mkcloudaccountswift -container jia -encrypt no -endpoint http:/
  /10.151.12.38:5000/v2.0 -gui -keystone -password #### -tenantname demo -username admin
  10           170904093456 superuser                                        10.165.21.185  0      0          mcsop mkmdiskgrp -unit mb -ext 1024 -gui -guiid 0 -intier auto -name
  Pool0 -warning 80%
  11           170904093504 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 0
  12           170904093505 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 2
  13           170904093506 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 7
  14           170904093508 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 8
  15           170904093509 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 11
  16           170904093510 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 5
  17           170904093511 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 1
  18           170904093512 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 3
  19           170904093513 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 4
  20           170904093514 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 9
  21           170904093515 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 6
  22           170904093516 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use candidate 10
  23           170904093527 superuser                                        10.165.21.185  0                 mcsop chdrive -gui -use spare 8
  24           170904093532 superuser                                        10.165.21.185  0      0          mcsop mkarray -drive 0:4:5:6:3:10:9:2:11:7:1 -gui -level raid6 -spare
  goal 1 -strip 256 Pool0
  25           170904093556 superuser                                        10.165.21.185  0      0          mcsop mkvdisk -gui -mdiskgrp 0 -name cl1 -size 1073741824 -unit b
  26           170904094709 superuser                                        10.165.21.185  0      0          mcsop mkhost -force -gui -iogrp 0:1:2:3 -iscsiname iqn.1991-05.com.mi
  crosoft:wang9jia11.home.langchao.com -name localhost-wj -type generic
  27           170904094739 superuser                                        10.165.21.185  0                 mcsop cfgportip -gui -gw 10.151.12.254 -ip 10.151.12.94 -mask 255.255
  .255.0 -node 1 1
  28           170904095356 superuser                                        10.165.21.185  0                 mcsop mkvdiskhostmap -force -gui -host 0 0
  29           170904095647 superuser                                        10.165.21.185  0                 mcsop chvdisk -account 0 -backup cloud -enable -gui 0
  30           170904100428 superuser                                        10.165.21.185  0                 mcsop backupvolume -gui 0
  31           170904100735 superuser                                        10.165.21.185  0                 mcsop backupvolume -gui 0
#+END_SRC
- dumpinternallog
- startstats, settrace, starttrace, stoptrace
- triggerdrivedump
- addnode, addcontrolenclosure, lsnode, lsnodecanister
#+BEGIN_SRC shell
  Inspur_MCS:C90:superuser>lsnodecanister
  id name  UPS_serial_number WWNN             status IO_group_id IO_group_name config_node UPS_unique_id hardware iscsi_name                           iscsi_alias panel_name enclosure_id canister_id enclosure_serial_number site_id site_name
  1  node1                   5005076803002010 online 0           io_grp0       yes                       I1M      iqn.2004-12.com.inspur:mcs.c90.node1             01-1       1            1           6577501

  Inspur_MCS:C90:superuser>lsnodecanister -delim :
  id:name:UPS_serial_number:WWNN:status:IO_group_id:IO_group_name:config_node:UPS_unique_id:hardware:iscsi_name:iscsi_alias:panel_name:enclosure_id:canister_id:enclosure_serial_number:site_id:site_name
  1:node1::5005076803002010:online:0:io_grp0:yes::I1M:iqn.2004-12.com.inspur:mcs.c90.node1::01-1:1:1:6577501::
#+END_SRC

